Autodesk.Navisworks.Api.Document.GenerateThumbnail(System.Int32,System.Int32,System.Double)
Generates a Thumbnail Image for this Document.

Autodesk.Navisworks.Api.Document.GenerateThumbnailByRayTrace(System.Int32,System.Int32)
Generates a thumbnail by ray trace for this Document.